isc-fs/stm32-can-bootloader/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal_rcc_ex.h"
#include "stm32h7xx_hal_pwr_ex.h"

#include "bl_app_validate.h"
#include "bl_memmap.h"
#include "bl_config.h"
#include "bl_dtc.h"
#include "bl_fault.h"
#include "bl_fdcan.h"
#include "bl_health.h"
#include "bl_iwdg.h"
#include "bl_live.h"
#include "bl_log.h"
#include "bl_node_id.h"
#include "bl_nvm.h"
#include "bl_obyte.h"
#include "bl_proto.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef void (*pFunction)(void);
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* Flash layout / magic values come from bl_memmap.h.
 * Protocol constants and opcodes come from bl_proto.h. */

#define LED_OK_ON()         HAL_GPIO_WritePin(OK_STATUS_GPIO_Port, OK_STATUS_Pin, GPIO_PIN_SET)
#define LED_OK_OFF()        HAL_GPIO_WritePin(OK_STATUS_GPIO_Port, OK_STATUS_Pin, GPIO_PIN_RESET)
#define LED_OK_TOGGLE()		HAL_GPIO_TogglePin(OK_STATUS_GPIO_Port, OK_STATUS_Pin)

#define LED_ERR_ON()         HAL_GPIO_WritePin(ERR_STATUS_GPIO_Port, ERR_STATUS_Pin, GPIO_PIN_SET)
#define LED_ERR_OFF()        HAL_GPIO_WritePin(ERR_STATUS_GPIO_Port, ERR_STATUS_Pin, GPIO_PIN_RESET)
#define LED_ERR_TOGGLE()	 HAL_GPIO_TogglePin(ERR_STATUS_GPIO_Port, ERR_STATUS_Pin)

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

FDCAN_HandleTypeDef hfdcan1;
FDCAN_HandleTypeDef hfdcan2;
FDCAN_HandleTypeDef hfdcan3;

/* USER CODE BEGIN PV */
static uint8_t  g_AutoJumpEnabled  = 0U;
static uint32_t g_AutoJumpDeadline = 0U;

/* #146 H2: cache the (full-image-CRC) Bootloader_CheckApplication result so
 * the per-tick hot path (bl_health / bl_live, every main-loop iteration
 * during a session) doesn't re-CRC the whole app each pass and stall the RX
 * drain. Invalidated on any FLASH_* op via Bootloader_InvalidateAppCheckCache(). */
static uint8_t  g_appcheck_result = 0xFFU;
static uint8_t  g_appcheck_valid  = 0U;

/* #166/G-A2/NG-1: set once at boot from the bl_appcheck breadcrumb — true when
 * a PRIOR boot faulted while reading flash (the double-bit-ECC-on-partial-write
 * trap). On a recovery boot the BL skips every sector-7 + app read (which would
 * re-fault) and comes up minimal + reachable: NVM degraded, node-id at the
 * compile-time default, app reported invalid. */
static uint8_t  g_ecc_recovery = 0U;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_FDCAN3_Init(void);
/* USER CODE BEGIN PFP */
static void Bootloader_Init(void);
static void Bootloader_MainLoop(void);
static void Bootloader_FdcanBusOffRecover(uint32_t now_ms);
/* Bootloader_ConfigFdcanFilters moved to bl_fdcan_configure_filters in
 * bl_fdcan.c (#120 Phase A) — see bl_fdcan.h. */
/* Bootloader_JumpToApplication / Bootloader_CheckApplication are declared
 * with external linkage in main.h so bl_proto.c can call them for
 * CMD_RESET (mode=to-app) and CMD_JUMP. */
static uint32_t Bootloader_CalcCrc32(uint32_t address, uint32_t lengthBytes);
static uint8_t  Bootloader_CheckApplicationCompute(void);   /* #146 H2: uncached core */
static uint8_t  Bootloader_CheckApplicationInner(void);     /* #166: raw read, ECC-unsafe */
static uint8_t  Bootloader_IsBootRequestActive(void);
static uint8_t  Bootloader_IsBootAppRequestActive(void);   /* #142 */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
	/* #174 (NG-2 / NG-11): arm the IWDG as the very FIRST thing the BL does —
	 * before HAL_Init and SystemClock_Config. bl_iwdg_start is pure IWDG1
	 * register writes off the LSI, with no HAL or main-clock dependency, so it
	 * is safe here. This backstops every cold-boot hang that runs before the
	 * watchdog used to be armed in Bootloader_Init — most importantly the
	 * unbounded VOSRDY wait in SystemClock_Config (a regulator that never
	 * reports ready would otherwise hang forever with no recovery) — and
	 * re-periods the inherited ~100 ms app IWDG (the 0x002 app->BL reset path)
	 * to the BL's ~8 s at the earliest possible instant. Bootloader_Init
	 * re-arms it once the clocks are up. */
	bl_iwdg_start();
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
	/* #174 (NG-4): enable the HSE Clock Security System now the PLL is locked.
	 * If the HSE dies at runtime (cracked crystal, vibration, solder fatigue)
	 * the CSS raises an NMI -> NMI_Handler -> bl_fault_reboot, turning a silent
	 * hung-clock state into a deterministic reboot. NOTE: the FDCAN kernel clock
	 * is wired to the HSE, so CAN is still dead after such a reboot — crystal-
	 * independent CAN (FDCAN off a PLL/HSI source) is the larger fix tracked in
	 * #163; CSS here is the cheap deterministic-failure half. */
	HAL_RCC_EnableCSS();
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_FDCAN1_Init();
  MX_FDCAN2_Init();
  MX_FDCAN3_Init();
  /* USER CODE BEGIN 2 */

