isc-fs/stm32-can-bootloader/Core/Src/main.c
}

/**
  * @brief FDCAN3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_FDCAN3_Init(void)
{

  /* USER CODE BEGIN FDCAN3_Init 0 */

  /* USER CODE END FDCAN3_Init 0 */

  /* USER CODE BEGIN FDCAN3_Init 1 */

  /* USER CODE END FDCAN3_Init 1 */
  hfdcan3.Instance = FDCAN3;
  hfdcan3.Init.FrameFormat = FDCAN_FRAME_CLASSIC;
  hfdcan3.Init.Mode = FDCAN_MODE_NORMAL;
  hfdcan3.Init.AutoRetransmission = ENABLE;   /* #94: MUST be ENABLE — lost-arbitration frames retried, not silently dropped */
  hfdcan3.Init.TransmitPause = DISABLE;
  hfdcan3.Init.ProtocolException = DISABLE;
  hfdcan3.Init.NominalPrescaler = 3;
  hfdcan3.Init.NominalSyncJumpWidth = 1;
  hfdcan3.Init.NominalTimeSeg1 = 10;
  hfdcan3.Init.NominalTimeSeg2 = 5;
  hfdcan3.Init.DataPrescaler = 1;
  hfdcan3.Init.DataSyncJumpWidth = 1;
  hfdcan3.Init.DataTimeSeg1 = 1;
  hfdcan3.Init.DataTimeSeg2 = 1;
  hfdcan3.Init.MessageRAMOffset = 0;
  hfdcan3.Init.StdFiltersNbr = 2;
  hfdcan3.Init.ExtFiltersNbr = 1;
  hfdcan3.Init.RxFifo0ElmtsNbr = 16;
  hfdcan3.Init.RxFifo0ElmtSize = FDCAN_DATA_BYTES_8;
  hfdcan3.Init.RxFifo1ElmtsNbr = 16;
  hfdcan3.Init.RxFifo1ElmtSize = FDCAN_DATA_BYTES_8;
  hfdcan3.Init.RxBuffersNbr = 0;
  hfdcan3.Init.RxBufferSize = FDCAN_DATA_BYTES_8;
  hfdcan3.Init.TxEventsNbr = 0;
  hfdcan3.Init.TxBuffersNbr = 0;
  hfdcan3.Init.TxFifoQueueElmtsNbr = 16;
  hfdcan3.Init.TxFifoQueueMode = FDCAN_TX_FIFO_OPERATION;
  hfdcan3.Init.TxElmtSize = FDCAN_DATA_BYTES_8;
  if (HAL_FDCAN_Init(&hfdcan3) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN FDCAN3_Init 2 */

  /* USER CODE END FDCAN3_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, OK_STATUS_Pin|ERR_STATUS_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : OK_STATUS_Pin ERR_STATUS_Pin */
  GPIO_InitStruct.Pin = OK_STATUS_Pin|ERR_STATUS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* ===================== BOOTLOADER CORE ========================= */

static void Bootloader_Init(void) {
	/* #125 H6 / #174: re-arm + reload the IWDG. The PRIMARY arm now happens
	 * as the first statement of main() (NG-2/NG-11) so the watchdog covers
	 * clock bring-up too; this call re-confirms the BL's ~8 s period and
	 * gives a fresh reload now that the (potentially slow) clock + FDCAN
	 * init is done, before the NVM scan / filter config below. Idempotent. */
	bl_iwdg_start();

	LED_OK_ON();
	LED_ERR_OFF();

	/* #125 H6: enable the DWT cycle counter, used by bl_flash_erase to
	 * time the erase. HAL_GetTick can't measure it — on the single-bank
	 * H733 the CPU stalls on instruction fetch for the whole erase, so
	 * SysTick interrupts starve and the tick barely advances. CYCCNT is
	 * clock-driven and counts through the stall. Set once, here. */
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CYCCNT = 0U;
	DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

	/* Latch the reset cause before anything else has a chance to clear
	 * RCC->RSR. Health reporting depends on this surviving the rest of
	 * the boot sequence. */
	bl_health_init();

	/* Bring up the DTC table in Backup SRAM. Runs after bl_health_init
	 * so bl_dtc_log can timestamp entries against uptime. Also validates
	 * the magic so a power-cycled BKPSRAM starts from a clean slate. */
	bl_dtc_init();

	/* Bring up the log ring in Backup SRAM (adjacent to the DTC table).
	 * Same persistence semantics — a host that reconnects after a crash
	 * can replay the last ~1 KB of bootloader log by issuing
	 * LOG_STREAM_START. */
	bl_log_init();
	bl_log_info("bootloader up (reset_cause=%u)",
	            (unsigned int)bl_health_reset_cause());

	/* #125 H6 (reset-on-spin): if the previous boot ended in a
	 * controlled reboot from a terminal fault (a CPU fault handler,
	 * Error_Handler, or a failed FDCAN init), bl_fault left a
	 * reset-surviving breadcrumb. Log it now — in this safe post-reset
	 * context, where bl_dtc_log's NOTIFY path is fine — so the cause is
	 * visible via `diagnose dtc` / health.last_dtc_code. One-shot:
	 * take_pending clears it. */
	uint8_t fault_reason = BL_FAULT_NONE;
	if (bl_fault_take_pending(&fault_reason)) {
		bl_dtc_log(BL_DTC_CPU_FAULT, BL_DTC_SEV_FATAL, (uint32_t)fault_reason);
		bl_log_error("recovered from fault reboot (reason=%u)",
		             (unsigned int)fault_reason);
	}

	/* Zero the live-data counters. The snapshot is pulled together on
	 * demand in bl_live_tick, so no persistent state needs initialising
	 * beyond this. */
	bl_live_init();

	/* #166: clear any flash error/ECC state latched by a prior interrupted
	 * write, before the first flash read (bl_nvm_init below) or any program.
	 * A power-cut mid-write can leave the controller with a stale error or
	 * lock latch that would otherwise reject the recovery reflash. (The
	 * corrupt *word* itself still double-bit-ECC-faults when read — that is
	 * handled by the bl_appcheck guard around app validation; this just keeps
	 * the flash controller's own status clean.) */
	__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS_BANK1);

	/* #166/G-A2/NG-1: did a prior boot fault while reading flash? bl_appcheck
	 * stamps a reset-surviving breadcrumb on any fault taken while the guard is
	 * armed; consume it once here. The two sector-7 reads below (bl_nvm_init's
	 * scan + the node-id read) run BEFORE CAN is up — an ECC fault in either
	 * would otherwise reboot-loop the chip unreachable, exactly #166 in a read
	 * its app-only guard never covered. */
	g_ecc_recovery = bl_appcheck_take_pending();

	if (g_ecc_recovery) {
		/* Recovery boot: do NOT touch sector 7 (it may re-fault). Come up
		 * minimal + reachable — NVM degraded (no scan; writes rejected until
		 * NVM_FORMAT) and the node-id left at its compile-time default; the app
		 * check is skipped too (Bootloader_CheckApplicationCompute). Recover by
		 * issuing NVM_FORMAT then reflashing; discover the unit at the DEFAULT
		 * node-id meanwhile. */
		bl_log_warn("flash-read ECC fault last boot — NVM+app untrusted; NVM_FORMAT + reflash to recover (default node-id)");
		bl_nvm_init_degraded();
		/* Still resolve the node-id so the RX filter is built — in degraded
		 * mode the NVM read returns NOT_FOUND without scanning sector 7, so
		 * this falls back to the compile-time default id (no fault). */
		bl_node_id_init_from_nvm();
	} else {
		/* Normal boot. Arm the breadcrumb guard around the sector-7 reads so an
		 * ECC fault here recovers (next boot lands in the branch above) instead
		 * of reboot-looping. The __DSB/__ISB before disarm forces any IMPRECISE
		 * bus fault from the reads to retire INSIDE the armed window — on
		 * Cortex-M7 a flash double-bit-ECC fault can be imprecise, and BusFault
		 * is not enabled, so it escalates to HardFault asynchronously (NG-1). */
		bl_appcheck_arm(true);

