isc-fs/stm32-can-bootloader/Core/Src/main.c
		/* Scan the NVM sector for the append point + highest seq. Safe even on
		 * a fully-erased sector (g_write_pos lands at 0). */
		bl_nvm_init();

		/* Resolve the effective node ID now that NVM is queryable; must run
		 * BEFORE the FDCAN filter config (the filter is built from the ID). */
		bl_node_id_init_from_nvm();

		__DSB();
		__ISB();
		bl_appcheck_arm(false);
	}

	/* #120: the BL serves all three FDCAN peripherals at once (see
	 * bl_fdcan.c). MX_FDCAN{1,2,3}_Init in main() has already initialised
	 * the handles; the filter config + start_all below bring up every bus,
	 * so a host on whichever bus the board wires CAN to is heard. */

	/* Boot-time WRP self-check. Production-provisioned units are
	 * expected to have sector 0 (the bootloader) WRP-protected; a
	 * missing latch is not fatal but it earns a WARN log line so the
	 * host's log stream flags it on connect. The WRP_PROTECTED flag in
	 * both health and live-data reflects this same check, so a host
	 * can gate OB_APPLY_WRP on the flag. */
	if (!bl_obyte_is_sector_wrp_protected(0U)) {
		bl_log_warn("WRP: bootloader sector 0 not write-protected; run OB_APPLY_WRP to latch");
	}

	/* Filters must be configured while the FDCAN is still in Init mode —
	 * i.e. before HAL_FDCAN_Start. Filter shape is instance-agnostic;
	 * `bl_fdcan_configure_filters` lives in bl_fdcan.c (#120 Phase A)
	 * and accepts the resolved node-id directly so it doesn't have to
	 * include bl_node_id.h itself. */
	if (bl_fdcan_configure_filters(bl_node_id_get()) != HAL_OK) {
		/* #125 H6: a failed FDCAN bring-up used to spin here forever —
		 * the board went dead with no CAN, unflashable. Reboot instead;
		 * a transient init failure self-recovers, and the breadcrumb
		 * surfaces a BL_DTC_CPU_FAULT next boot. */
		LED_ERR_ON();
		bl_fault_reboot(BL_FAULT_FDCAN_INIT);
	}

	if (bl_fdcan_start_all() != HAL_OK) {
		LED_ERR_ON();
		bl_fault_reboot(BL_FAULT_FDCAN_INIT);
	}

	/* #125 M3: guard the issue #94 fix. AutoRetransmission MUST be
	 * ENABLE or lost-arbitration frames are silently dropped while
	 * tx->seq has already advanced — which corrupts multi-frame TX
	 * sequencing on a contended bus (the #94 Bug B signature). That's
	 * set in MX_FDCAN2_Init, but a CubeMX regeneration could flip it
	 * back with no test catching it. Read the LIVE peripheral register
	 * (CCCR.DAR = "Disable Automatic Retransmission") rather than the
	 * RAM Init struct, so this actually reflects hardware state. DAR
	 * set ⇒ retransmission disabled ⇒ regression. Log loudly; the BL
	 * still runs (degraded) so the bus stays reachable to reflash a
	 * corrected build. */
	for (uint8_t b = 0U; b < BL_FDCAN_BUS_COUNT; b++) {
		if ((bl_fdcan_bus(b)->Instance->CCCR & FDCAN_CCCR_DAR) != 0U) {
			bl_log_error("FDCAN%u AutoRetransmission DISABLED (CCCR.DAR set) — "
			             "issue #94 regression; multi-frame TX will desync",
			             (unsigned int)(b + 1U));
		}
	}

	/* NOTE on FDCAN interrupts: the main loop drains RX_FIFO0 by
	 * polling (HAL_FDCAN_GetRxFifoFillLevel + GetRxMessage below), so
	 * we deliberately do NOT activate FDCAN_IT_RX_FIFO0_NEW_MESSAGE.
	 *
	 * The previous code enabled the notification but never overrode
	 * HAL_FDCAN_RxFifo0Callback — so every RX frame entered the IRQ
	 * (FDCAN2_IT0_IRQHandler → HAL_FDCAN_IRQHandler) only to dispatch
	 * the default weak callback and return. Pure overhead, and a
	 * footgun for anyone who later added a real callback expecting
	 * it to actually drive RX while the main loop was still polling
	 * — concurrent drain of the same FIFO would have dropped frames.
	 * Audit follow-up (#68 last bullet). */

	/* #142: honour a one-shot "boot the app" request first. handle_jump /
	 * handle_reset set BL_BOOT_APP_MAGIC + reset when a flash write happened
	 * this session, so a write-then-jump reaches the app through a clean
	 * reset (the flash is idle again, cold-equivalent) rather than a direct
	 * warm jump that can leave the freshly-written app stuck. Jump straight
	 * to the just-written, re-validated app. */
	if (Bootloader_IsBootAppRequestActive()) {
		if (Bootloader_CheckApplication() == 0x00U) {
			Bootloader_JumpToApplication();   /* never returns on success */
		}
		/* App not valid (shouldn't happen right after a verified write) —
		 * fall through to listen mode rather than brick. */
		g_AutoJumpEnabled = 0U;
	} else {
		/* Check if application explicitly requested to stay in bootloader */
		uint8_t bootReq = Bootloader_IsBootRequestActive();

		if (bootReq) {
			/* Stay in bootloader, do not arm auto-jump */
			g_AutoJumpEnabled = 0U;
		} else {
			/* Normal behavior: arm auto-jump if a valid application is present */
			uint8_t appStatus = Bootloader_CheckApplication();
			if (appStatus == 0x00U) {
				g_AutoJumpEnabled = 1U;
				g_AutoJumpDeadline = HAL_GetTick() + 2000U; /* e.g. 2 seconds window */
			} else {
				g_AutoJumpEnabled = 0U;
			}
		}
	}
}

/* #125 C1: poll FDCAN protocol status and recover from Bus_Off.
 *
 * On Bus_Off the M_CAN sets CCCR.INIT and halts both TX and RX — the
 * BL stops ACKing and the host's session dies; the device is
 * unflashable over CAN until a power-cycle (and re-enters Bus_Off if
 * the fault persists). Recovery is a Stop→Start: HAL_FDCAN_Stop puts
 * the peripheral back to READY (INIT stays set), HAL_FDCAN_Start
 * clears INIT and arms the M_CAN's automatic recovery (it rejoins
 * after 128×11 consecutive recessive bits — ~2.8 ms of idle bus at
 * 500 kbps). The two RX filters live in message RAM, which Stop/Start
 * does NOT touch, so they survive — no need to reconfigure.
 *
 * Rate-limit: act on the transition INTO Bus_Off, then at most once
 * per BL_FDCAN_BUSOFF_RETRY_MS while it persists. Without this, calling
 * Stop/Start every loop iteration would continually restart the
 * recovery sequence and the node would never actually rejoin.
 *
 * GetProtocolStatus is a cheap PSR register read; safe to poll every
 * iteration. The Stop/Start only runs on an actual fault (rare).
 *
 * Observability (so the bench can confirm it fired): a per-boot
 * recovery counter in the health record (`fdcan_recovery_count`), a
 * BL_DTC_FDCAN_BUSOFF DTC carrying the attempt count, and a WARN log
 * line. */
#define BL_FDCAN_BUSOFF_RETRY_MS   100U

static void Bootloader_FdcanBusOffRecover(uint32_t now_ms) {
	static uint8_t  s_was_busoff[BL_FDCAN_BUS_COUNT]      = { 0U };
	static uint32_t s_last_attempt_ms[BL_FDCAN_BUS_COUNT] = { 0U };

	/* Each bus recovers independently — one bus going Bus_Off (a shorted
	 * transceiver, a disconnected stub) must not disturb the others. */
	for (uint8_t b = 0U; b < BL_FDCAN_BUS_COUNT; b++) {
		FDCAN_HandleTypeDef *h = bl_fdcan_bus(b);

		FDCAN_ProtocolStatusTypeDef ps = { 0 };
		if (HAL_FDCAN_GetProtocolStatus(h, &ps) != HAL_OK) {
			continue;
		}

		if (ps.BusOff == 0U) {
			s_was_busoff[b] = 0U;
			continue;
		}

